# Semana 02 Datos
## Tarea 02: Carga y Preprocesamiento de Datos.
### Parte 01: Carga de datos

In [1]:
#Importamos las paqueterias necesarias para la lectura de datos.
import pandas as pd

In [2]:
#Lectura de datos
application_record = pd.read_csv('../Datasets/application_record.csv')
credit_record = pd.read_csv('../Datasets/credit_record.csv')

In [4]:
#Renombramos las columnas para mejor lectura
credit_record.columns = [
    'ID', 'Mes extraccion','Estado'
]
credit_record.head(10)

        ID  Mes extraccion Estado
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C
5  5001712              -1      C
6  5001712              -2      C
7  5001712              -3      C
8  5001712              -4      C
9  5001712              -5      C

In [3]:
#Renombramos las columnas para mejor lectura
application_record.columns = [
    'ID', 'Genero', 'Dueño Carro', 'Dueño Propiedad', '# de Hijos', 'Ingresos Anuales','Tipo de Ingresos', 
    'Nivel Educación', 'Estado Civil', 'Tipo de Vivienda', 'Dias desde Cumpleaños', 'Dias desde Empleo', 
    'Existencia Celular','Existencia Telefono Trabajo', 'Existencia Telefono', 'Existencia Correo', 
    'Ocupación', 'Tamaño Familia'
]
application_record.head(10)

,ID,Genero,Dueño Carro,Dueño Propiedad,# de Hijos,Ingresos Anuales,Tipo de Ingresos,Nivel Educación,Estado Civil,Tipo de Vivienda,Dias desde Cumpleaños,Dias desde Empleo,Existencia Celular,Existencia Telefono Trabajo,Existencia Telefono,Existencia Correo,Ocupación,Tamaño Familia
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
5,5008810,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
6,5008811,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
7,5008812,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0
8,5008813,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0
9,5008814,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,NaN,1.0

In [8]:
# Revisamos la existencia de nulos, no se encuentran valores faltantes.
credit_record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   Mes extraccion  1048575 non-null  int64
 2   Estado          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [7]:
# Revisamos la existencia de nulos en el df application, encontramos que 134203 de la columna ocupacion entradas alrededor del 30 %
application_record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   ID                           438557 non-null  int64
 1   Genero                       438557 non-null  object
 2   Dueño Carro                  438557 non-null  object
 3   Dueño Propiedad              438557 non-null  object
 4   # de Hijos                   438557 non-null  int64
 5   Ingresos Anuales             438557 non-null  float64
 6   Tipo de Ingresos             438557 non-null  object
 7   Nivel Educación              438557 non-null  object
 8   Estado Civil                 438557 non-null  object
 9   Tipo de Vivienda             438557 non-null  object
 10  Dias desde Cumpleaños        438557 non-null  int64
 11  Dias desde Empleo            438557 non-null  int64
 12  Existencia Celular           438557 non-null  int64
 13  Existencia Telefono Trabajo  438557 non-null  int64
 14  Existencia Telefono          438557 non-null  int64
 15  Existencia Correo            438557 non-null  int64
 16  Ocupación                    304354 non-null  object
 17  Tamaño Familia               438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

### Parte 02: Preprocesamiento de datos

Me gustaria revisar la cantidad de Id Unicos de cada df y revisar si hay registros que no contengan informacion en los 2.

In [12]:
print(f'El número de registros únicos en el df application_record es: {len(set(application_record["ID"]))}')
print(f'El número de registros únicos en el df credit_record es: {len(set(credit_record["ID"]))}')

El número de registros únicos en el df application_record es: 438510
El número de registros únicos en el df credit_record es: 45985

Podemos ver que hay una diferencia entre la cantidad de registros unicos de ambos dataframes, revisaremos cuantos id unicos estan ambos en común.

In [13]:
print(f'El número de registros únicos que contienen información en ambos df son: {len(set(application_record['ID']).intersection(set(credit_record['ID'])))}')

El número de registros únicos que contienen información en ambos df son: 36457

In [15]:
grouped = credit_record.groupby('ID')
grouped.head(10)

              ID  Mes extraccion Estado
0        5001711               0      X
1        5001711              -1      0
2        5001711              -2      0
3        5001711              -3      0
4        5001712               0      C
...          ...             ...    ...
1048550  5150487              -5      C
1048551  5150487              -6      C
1048552  5150487              -7      C
1048553  5150487              -8      C
1048554  5150487              -9      C

[410635 rows x 3 columns]